{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "from neo4j.v1 import GraphDatabase, basic_auth\n",
    "import itertools\n",
    "from joblib import Parallel, delayed\n",
    "%matplotlib inline\n",
    "import multiprocessing\n",
    "import time\n",
    "import plotly.plotly as py\n",
    "import numpy as np\n",
    "from scipy.cluster.hierarchy import dendrogram, linkage\n",
    "from plotly.tools import FigureFactory as FF"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "num_cores = multiprocessing.cpu_count()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(\"bolt://localhost\", auth=basic_auth(\"neo4j\", \"dmkm1234\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "session = driver.session()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0.131901025772\n"
     ]
    }
   ],
   "source": [
    "t = time.time()\n",
    "for i in range(0,400):\n",
    "    session.run(\"MATCH (ar:Articles)-[:isArticle]-(s:Signatures)-[:isAuthor]-(au:Authors) WHERE ar.article_id in range (%s,%s) WITH (ar.article_id) as article, collect(au.author_id) as authorlist MATCH (au1:Authors),(au2:Authors) WHERE au1.author_id in authorlist and au2.author_id in authorlist MERGE (au1)-[r:isCoauthor]-(au2)\" % (i*1000,(i+1)*1000))\n",
    "elapsed = time.time() - t\n",
    "print(elapsed)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0.11606502533\n"
     ]
    }
   ],
   "source": [
    "t = time.time()\n",
    "for i in range(0,400):\n",
    "    session.run(\"MATCH (ar:Articles)-[:isArticle]-(s:Signatures)-[:isAuthor]-(au:Authors) WHERE ar.article_id in range(%s,%s) WITH (ar.article_id) as article, collect(au.author_id) as authorlist MATCH (ar:Articles),(au:Authors) WHERE ar.article_id = article and au.author_id in authorlist MERGE (ar)<-[r:isWritten]-(au)\"% (i*1000,(i+1)*1000) ) \n",
    "elapsed = time.time() - t\n",
    "print(elapsed)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0.0450179576874\n"
     ]
    }
   ],
   "source": [
    "t = time.time()\n",
    "for i in range(0,98):\n",
    "    session.run(\"MATCH (n:Authors)-[r:isCoauthor]-(m:Authors) WITH n.author_id as ntop, COUNT(r) as rank  order by rank desc skip %s limit %s WITH collect(ntop) as autop MATCH (au1:Authors)-[r:isCoauthor]-(au2:Authors) WHERE au1.author_id in autop and au2.author_id in autop MERGE (au1)-[r2:isMain]-(au2)\" % (i*100,(i+1)*100))\n",
    "elapsed = time.time() - t\n",
    "print(elapsed)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1.04347085953\n"
     ]
    }
   ],
   "source": [
    "t = time.time()\n",
    "result0 = session.run(\"MATCH p = (a1:Authors)-[r:isMain*0]-(a2:Authors) WHERE ID(a1) < ID (a2)  WITH (a1.author_id) as aa1, (a2.author_id) as aa2, length(p) as d RETURN (aa1), (aa2), min(d)\")\n",
    "for line in result0:\n",
    "    print (line)\n",
    "elapsed = time.time() - t\n",
    "print(elapsed)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0.00289607048035\n"
     ]
    }
   ],
   "source": [
    "t = time.time()\n",
    "result1 = session.run(\"MATCH p = (a1:Authors)-[r:isMain*1]-(a2:Authors) WHERE ID(a1) < ID (a2)  WITH (a1.author_id) as aa1, (a2.author_id) as aa2, length(p) as d RETURN (aa1), (aa2), min(d)\")\n",
    "elapsed = time.time() - t\n",
    "print(elapsed)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0.000517129898071\n"
     ]
    }
   ],
   "source": [
    "t = time.time()\n",
    "result2 = session.run(\"MATCH p = (a1:Authors)-[r:isMain*2]-(a2:Authors) WHERE ID(a1) < ID (a2)  WITH (a1.author_id) as aa1, (a2.author_id) as aa2, length(p) as d RETURN (aa1), (aa2), min(d)\")\n",
    "elapsed = time.time() - t\n",
    "print(elapsed)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "dist = np.matrix('0,0,0')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "11.5645999908\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "1"
      ]
     },
     "execution_count": 60,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "t = time.time()\n",
    "result = session.run(\"MATCH p = (a1:Authors)-[r:isMain*1]-(a2:Authors) WHERE ID(a1) < ID (a2)  WITH (a1.author_id) as aa1, (a2.author_id) as aa2, length(p) as d RETURN (aa1), (aa2), min(d)\")\n",
    "for e in result:\n",
    "    np.append(dist,[[e[\"aa1\"],e[\"aa2\"],e[\"min(d)\"]]],axis=0)\n",
    "elapsed = time.time() - t\n",
    "print(elapsed)\n",
    "len(dist)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "matrix([[0, 0, 0]])"
      ]
     },
     "execution_count": 61,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dist"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "ename": "ValueError",
     "evalue": "The number of observations cannot be determined on an empty distance matrix.",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mValueError\u001b[0m                                Traceback (most recent call last)",
      "\u001b[1;32m<ipython-input-58-5f928e7eecef>\u001b[0m in \u001b[0;36m<module>\u001b[1;34m()\u001b[0m\n\u001b[1;32m----> 1\u001b[1;33m \u001b[0mdendro\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mFF\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mcreate_dendrogram\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mdist\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m      2\u001b[0m \u001b[0mdendro\u001b[0m\u001b[1;33m[\u001b[0m\u001b[1;34m'layout'\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mupdate\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m{\u001b[0m\u001b[1;34m'width'\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;36m800\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;34m'height'\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;36m500\u001b[0m\u001b[1;33m}\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m      3\u001b[0m \u001b[0mpy\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0miplot\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mdendro\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mfilename\u001b[0m\u001b[1;33m=\u001b[0m\u001b[1;34m'simple_dendrogram'\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32m/usr/local/lib/python2.7/dist-packages/plotly/tools.pyc\u001b[0m in \u001b[0;36mcreate_dendrogram\u001b[1;34m(X, orientation, labels, colorscale)\u001b[0m\n\u001b[0;32m   5817\u001b[0m             \u001b[0mexceptions\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mPlotlyError\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34m\"X should be 2-dimensional array.\"\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m   5818\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m-> 5819\u001b[1;33m         \u001b[0mdendrogram\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0m_Dendrogram\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mX\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0morientation\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mlabels\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mcolorscale\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m   5820\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m   5821\u001b[0m         return {'layout': dendrogram.layout,\n",
      "\u001b[1;32m/usr/local/lib/python2.7/dist-packages/plotly/tools.pyc\u001b[0m in \u001b[0;36m__init__\u001b[1;34m(self, X, orientation, labels, colorscale, width, height, xaxis, yaxis)\u001b[0m\n\u001b[0;32m   6767\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m   6768\u001b[0m         (dd_traces, xvals, yvals,\n\u001b[1;32m-> 6769\u001b[1;33m             ordered_labels, leaves) = self.get_dendrogram_traces(X, colorscale)\n\u001b[0m\u001b[0;32m   6770\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m   6771\u001b[0m         \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mlabels\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mordered_labels\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32m/usr/local/lib/python2.7/dist-packages/plotly/tools.pyc\u001b[0m in \u001b[0;36mget_dendrogram_traces\u001b[1;34m(self, X, colorscale)\u001b[0m\n\u001b[0;32m   6896\u001b[0m         \u001b[1;32mfrom\u001b[0m \u001b[0mplotly\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mgraph_objs\u001b[0m \u001b[1;32mimport\u001b[0m \u001b[0mgraph_objs\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m   6897\u001b[0m         \u001b[0md\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mscs\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mdistance\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mpdist\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mX\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m-> 6898\u001b[1;33m         \u001b[0mZ\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0msch\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mlinkage\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0md\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mmethod\u001b[0m\u001b[1;33m=\u001b[0m\u001b[1;34m'complete'\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m   6899\u001b[0m         P = sch.dendrogram(Z, orientation=self.orientation,\n\u001b[0;32m   6900\u001b[0m                            labels=self.labels, no_plot=True)\n",
      "\u001b[1;32m/usr/local/lib/python2.7/dist-packages/scipy/cluster/hierarchy.pyc\u001b[0m in \u001b[0;36mlinkage\u001b[1;34m(y, method, metric)\u001b[0m\n\u001b[0;32m    629\u001b[0m     \u001b[1;32mif\u001b[0m \u001b[0mlen\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0ms\u001b[0m\u001b[1;33m)\u001b[0m \u001b[1;33m==\u001b[0m \u001b[1;36m1\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    630\u001b[0m         \u001b[0mdistance\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mis_valid_y\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0my\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mthrow\u001b[0m\u001b[1;33m=\u001b[0m\u001b[0mTrue\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mname\u001b[0m\u001b[1;33m=\u001b[0m\u001b[1;34m'y'\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 631\u001b[1;33m         \u001b[0md\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mdistance\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mnum_obs_y\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0my\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    632\u001b[0m         \u001b[1;32mif\u001b[0m \u001b[0mmethod\u001b[0m \u001b[1;32mnot\u001b[0m \u001b[1;32min\u001b[0m \u001b[0m_cpy_non_euclid_methods\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    633\u001b[0m             raise ValueError(\"Valid methods when the raw observations are \"\n",
      "\u001b[1;32m/usr/local/lib/python2.7/dist-packages/scipy/spatial/distance.pyc\u001b[0m in \u001b[0;36mnum_obs_y\u001b[1;34m(Y)\u001b[0m\n\u001b[0;32m   1747\u001b[0m     \u001b[0mk\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mY\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mshape\u001b[0m\u001b[1;33m[\u001b[0m\u001b[1;36m0\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m   1748\u001b[0m     \u001b[1;32mif\u001b[0m \u001b[0mk\u001b[0m \u001b[1;33m==\u001b[0m \u001b[1;36m0\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m-> 1749\u001b[1;33m         raise ValueError(\"The number of observations cannot be determined on \"\n\u001b[0m\u001b[0;32m   1750\u001b[0m                          \"an empty distance matrix.\")\n\u001b[0;32m   1751\u001b[0m     \u001b[0md\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mint\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mnp\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mceil\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mnp\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0msqrt\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mk\u001b[0m \u001b[1;33m*\u001b[0m \u001b[1;36m2\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;31mValueError\u001b[0m: The number of observations cannot be determined on an empty distance matrix."
     ]
    }
   ],
   "source": [
    "dendro = FF.create_dendrogram(dist)\n",
    "dendro['layout'].update({'width':800, 'height':500})\n",
    "py.iplot(dendro, filename='simple_dendrogram')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "ename": "TypeError",
     "evalue": "Linkage matrix 'Z' must contain doubles.",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mTypeError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[1;32m<ipython-input-54-d7d053c0153d>\u001b[0m in \u001b[0;36m<module>\u001b[1;34m()\u001b[0m\n\u001b[0;32m      2\u001b[0m     \u001b[0mdist\u001b[0m\u001b[1;33m,\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m      3\u001b[0m     \u001b[0mleaf_rotation\u001b[0m\u001b[1;33m=\u001b[0m\u001b[1;36m90.\u001b[0m\u001b[1;33m,\u001b[0m  \u001b[1;31m# rotates the x axis labels\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m----> 4\u001b[1;33m     \u001b[0mleaf_font_size\u001b[0m\u001b[1;33m=\u001b[0m\u001b[1;36m8.\u001b[0m\u001b[1;33m,\u001b[0m  \u001b[1;31m# font size for the x axis labels\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m      5\u001b[0m )\n\u001b[0;32m      6\u001b[0m \u001b[0mplt\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mshow\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32m/usr/local/lib/python2.7/dist-packages/scipy/cluster/hierarchy.pyc\u001b[0m in \u001b[0;36mdendrogram\u001b[1;34m(Z, p, truncate_mode, color_threshold, get_leaves, orientation, labels, count_sort, distance_sort, show_leaf_counts, no_plot, no_labels, leaf_font_size, leaf_rotation, leaf_label_func, show_contracted, link_color_func, ax, above_threshold_color)\u001b[0m\n\u001b[0;32m   2228\u001b[0m                          \"'bottom', or 'right'\")\n\u001b[0;32m   2229\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m-> 2230\u001b[1;33m     \u001b[0mis_valid_linkage\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mZ\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mthrow\u001b[0m\u001b[1;33m=\u001b[0m\u001b[0mTrue\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mname\u001b[0m\u001b[1;33m=\u001b[0m\u001b[1;34m'Z'\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m   2231\u001b[0m     \u001b[0mZs\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mZ\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mshape\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m   2232\u001b[0m     \u001b[0mn\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mZs\u001b[0m\u001b[1;33m[\u001b[0m\u001b[1;36m0\u001b[0m\u001b[1;33m]\u001b[0m \u001b[1;33m+\u001b[0m \u001b[1;36m1\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32m/usr/local/lib/python2.7/dist-packages/scipy/cluster/hierarchy.pyc\u001b[0m in \u001b[0;36mis_valid_linkage\u001b[1;34m(Z, warning, throw, name)\u001b[0m\n\u001b[0;32m   1397\u001b[0m                             name_str)\n\u001b[0;32m   1398\u001b[0m         \u001b[1;32mif\u001b[0m \u001b[0mZ\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mdtype\u001b[0m \u001b[1;33m!=\u001b[0m \u001b[0mnp\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mdouble\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m-> 1399\u001b[1;33m             \u001b[1;32mraise\u001b[0m \u001b[0mTypeError\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34m'Linkage matrix %smust contain doubles.'\u001b[0m \u001b[1;33m%\u001b[0m \u001b[0mname_str\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m   1400\u001b[0m         \u001b[1;32mif\u001b[0m \u001b[0mlen\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mZ\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mshape\u001b[0m\u001b[1;33m)\u001b[0m \u001b[1;33m!=\u001b[0m \u001b[1;36m2\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m   1401\u001b[0m             raise ValueError('Linkage matrix %smust have shape=2 (i.e. be '\n",
      "\u001b[1;31mTypeError\u001b[0m: Linkage matrix 'Z' must contain doubles."
     ]
    }
   ],
   "source": [
    "dendrogram(\n",
    "    dist,\n",
    "    leaf_rotation=90.,  # rotates the x axis labels\n",
    "    leaf_font_size=8.,  # font size for the x axis labels\n",
    ")\n",
    "plt.show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "matrix([[0, 0, 0]])"
      ]
     },
     "execution_count": 55,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dist"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "import matplotlib.mlab as mlab\n",
    "import matplotlib.pyplot as plt"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "result = session.run(\"MATCH (n:Articles)-[r:isWritten]-(m:Authors) WITH m.author_id as ntop, COUNT(r) as rank order by rank desc RETURN rank\")\n",
    "r1 = []\n",
    "for line in result:\n",
    "    r1.append(line[\"rank\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAY0AAAEZCAYAAABrUHmEAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAIABJREFUeJzt3X+4XFV97/H3J4FwiEL4FUESk/A7kltEqtSWAgNegQvV\noC0VUFFRy6MWrTzW+Ks3J7YiXq0/UR4fiangRRQVAZEr0CZQtAgqEMQEUiG/IQIiCZCEGL73j7WG\nTCZnztmTM7P3nJPP63nOc2avmdn7O2v2zHf2WmuvrYjAzMysiDFVB2BmZiOHk4aZmRXmpGFmZoU5\naZiZWWFOGmZmVpiThpmZFeaksR0kXSLpYx1a10skrZWkvDxf0rmdWHde348lvaVT62tju/8i6VFJ\nqws+fraky7sdV6dJmifpExVv//eSbu/S+rfaPwd53PGSVnQjhpFipO7D7XLSaCJpqaRnJD2ZP4y3\nSTqv8UMTEe+OiE8WWNdDkk4c7DERsSIido8OnDCTd9rLmtZ/akSUuiNLeglwATA9IvYf4P5WXzA+\naagNkv4SeDWwf0S8qkPr3GqfbXP/3GHevx15H3bS2FYAp0XEBGAqcBEwC5jb6Q1JGtvpdfaIqcBj\nEfF4i/vFDvDhapekdj+P04ClEbGhA9serfsi0JXX19V9eDv2hfJEhP8a/oCHgBObyl4JbAYOz8vz\ngE/k23sD1wFPAI8Dt+Tyy/JzngbWAh8kfZk+B5wLLAMWNJSNyc+bD1wI/Bx4Erga2CPfdzywYqB4\ngZOBjflvHXBXw/rOzbcFfBxYCjwC/Buwe76vHsc5ObbfAR8dpJ52z6/xdzmGj+XyVwPPAH/Mr/sb\nTc8b33D/uvyY/YDZwHeAb+aye4GjGp73YuB7eXu/Bc4fJLZ5wMXAj/K6/gs4oOl1jml4fGMdvRW4\nDfhcfk+XAH8BvA1YnuvtnKZtXQLcmLc1H5jScP/0fN/jwCLgjKbnfhW4PtfFiQO8lhcD1+TnPwC8\nM5efC6wHNuXtzh7guQcC/w48luvtW/X3u2Hf+RBwT17X/6X1PlvfP/cEvgGsyjH9oGHfXF7k/SJ9\nnu4k7d8PA59t8T4eD6wAPgI8CjwInN1w/zjgs6T99eFcl7s0PfdD+b5vbkf9PAcc2PR+fYLt34en\n5/3jiXzfa9vZF3rlr/IAeu2PAZJGLl8GnNe48+TbF+Y3ewwwFjimaV0nNCzXP4D/BuwK7JLLNrN1\n0lgBvDQ/5nvA5fm+rT6YzfHmnfaypvsbvxDPJX3xTM07/vfrj2+I7Wv5w3gEsAE4rEU9XUZKaOPz\nc+8H3t4qzqbnDvQ6ZucP4smk5HYh8F/5PgG/AD6W63ga8N/Aa1qsfx7pS+ZP8/vyLeCKhtf5fH0P\nUEdvBZ4lJU8B/5zfjy8DOwOvIX0hjG/Y1pPAMfn+LwD/me8bT0o09XW9LMc1veG5TwCvysvjBngt\ntzZs+2WkL7daQ6y3DlLPB5GS+E6kHzcLgM817Tu/AvZny5ftQPts4/55PfBt0o+GscCxze/pUO8X\n8DPgTQ11dPQg+8km4DP59R8HPAUcku//PPBDYALwAlJy/WTTcy/Mz91lO+pnMwMkje3ch3ci/QCZ\nlW+fkPejQxrWPei+0Ct/vXsI1HtWA3sNUL6J9KvqgIjYHBE/bbq/uQMxSL8K10fExhbbujwiFkXE\neuCfgDOG6ogs6GzSh2JZRDxD+gV3ZsOhcAD9EfFsRCwk/QJ9WfNK8uPfCHw4Ip6JiGXAvwLD7XC/\nLSJ+EulTczkpcQEcDewTEZ/MdbwUuBQ4c5B1XR0Rv4yI50i/oI9sI46HIuKyHMd3SF+qcyJiU0Tc\nREoqBzc8/vqI+GlEbCJ9Ub5K0iTgrxrXFRH3kBL1GQ3PvSYibgeIiGcbg5A0GfhzYFbe9j35dZ9T\n5EVExG8j4t8j4o+Rmgo/T/qya/TFiFjdtC8OuK9JejHpC/G8iFib34v/HOChQ71fm4CDJe2d9587\nBnsZwD/l138rKWn9bb7vXcAHIuLJiHia1JR8VsNzN5M+a5sG+qwVqJ/t+cy12of/HHhBRHw6b28+\n6Ui4Md6W+0Iv2anqAEaQScDvByj/DNAP3CgpgK9HxKeHWNfKIe5v7GBbRvqltE/BOAezf15f47p3\nAvZtKFvTcPsZ4IUDrGef/LzlTeuaNMz4Hmnadl9OUFOASZLq9S/SEcStbaxroNfRSmMdrAeIiMea\nyhrX9/z7FRFPS3qCVNdTSQmkMe6xpKO0bZ47gP2B3+cEX7eMdAQ1JEkvAr4IHJvjHcu2+/BQ+2Kj\nyTmetUM8bqj361zSEdxiSQ+Sfr1f32JdT8TWfTbLgP0lTSQdpfyy4ffUGLb+on80J/IBFayfdrXa\nh1/Mtu9182dmRIw+c9IoQNIrSR/gbX5VRcRTpLbfD0o6HJgv6Y78SyJarLJVed1LGm5PJf0ye4zU\n1jy+Ia6xwMQ21rs6r6953WuatjmUx/LzpgKLG9a1quDzh4qz2QrgwYg4rM3nDeTp/H88qakDUnv0\ncDxfd5JeSGr3X02Ke0FEnDzIcweri9XAXpJekH9JQ/pCLlrPF5KaHGdExJOSZpKaugbb/mDxrMjx\n7D5E4hj0/YqI35KOepH018D3JO2Vj6yb7Slp14b7ppD6Ax4jfSnPiIiHW8Qx1H42VP08Q8PnjbSf\n1L/Y292HV7PtZ2wKqVm3aLw9wc1Tg5C0m6S/IrXhXh4RvxngMadJOigvriN1jm3Oy2tInW1bPWWg\nTTUtv1nSdEnjgTnAVflw9wHSL5f/JWknUqf2uIbnrQGmDdKU9W3gA5Km5S+3TwJX5iacVrFtIz/+\nu8AnJb1Q0lTgA6TD8SLWAHtL2n2Ix9XjuQNYJ+lDkvokjZU0Q9IrCm6vMfbHSF+6b5Y0Jp8Tc9AQ\nTxuqXk6V9BeSxpF+Qd8eEatIzQ+HSnqzpJ0k7SzpFZIKJb+IWElq//+UpF0kHQG8g+L1vBspMa7L\nzWX/WOA5j9Bin42IR4AbgK9K2iO/pmMHWMeg75ekN0mqHzk/SfqyfG6A9dS3PSfX3bHAacB38+fh\n68AX8lEHkiZJOqnAa6wbqn7uAs7O+8kpbN101e4+/HPgmVwnO0mqkZovv91GvD2h55KGkn+R9CVV\ncFJadp2kJ0nNLx8hjdBodcLdIcDNktYBPwW+ktteAT4F/FM+3+OCXDbQr4loun05aQTGalJSeD9A\n/nX3HtLw35WkJNXYvHAVaSd9XNIvBlj3N/K6byWNaHkGeF+LOFrFWve+/PwH8/q+FRHzBnn8lpVG\n3E/6sDyY66bVL/3Ij3+O9AE7ktRR+zvSF0arD+xQv9jeRRpV8xhpwEFzP9RQ62t+v64gNVE+Drwc\neHOO+yngJFJb/ur8dxFpAERRZwEH5Od+n9S+P7/gc+eQmrL+QBrh9/1BXkfdRQy+z76F9MNoMemL\n8/3NKyjwfp0C3CdpLakf4Y2D9O89TOogXk3ad8+LiCX5vlmkDvbbJf2BNErt0BbrGchQ9fMPwOvy\n9s8iDfyov8Z29+FNwGuBU0n73cXAWxpey4g4ygBQSti9Q9LpwOmkir2+jQ+ImY0iko4nHeFPqToW\n26LrRxqS5kpaI2lhU/kpkhZLekDSrIa7DgN+GhEfJP2qNjOzHlFG89Q80jC95+XRBBfn8hnAWZKm\n57tXkg4HYUvfgJmZ9YCuJ42IuI0tSaDuaGBJPl9gE3AlMDPf9wPgFElfBG7pdnxm1psi4hY3TfWe\nqobcTmLrMckrSYmEPLTunVUEZWZmgxuR52nkk+jMzKxNETGs2SWqGnK7inRiS91kip+wBMDs2bOZ\nP39+5fOwNP7Nnj278hgck2PaEeNyTIP/zZ8/n9mzZ3fky7uspCG2PkHqTtLcM1PzCVFnAte2s8L+\n/n5qtVrnIjQzG6VqtRr9/f0dWVcZQ26vIJ3Veqik5ZLeHhGbgfNJJ+PcRzoreVE76+3v72fBggUd\nj9fMbLRZsGBBx5JG1/s0IuLsFuU3kKYk2C6dqoBO6sUjH8dUjGMqrhfjckyDq9Vq1Go15syZM+x1\n9dwZ4UVIitmzZz9fEWZm1tqCBQtYsGABc+bMIYbZET5ik8ZIjNvMrEqShp00em7CQjMz610jNmm4\nI9zMrJhOdoS7ecrMbAfh5ikzMyvViE0abp4yMyvGzVNunjIza5ubp8zMrFQjcpZbgBlHzGDCnhPY\nZ+I+Qz+4g/bcY08u+dIljB8/vtTtmpltr/rJfZ0wYpundt1/V9a/an3p2+6b38cvb/slhx9+eOnb\nNjMbjk40T43YI41xE8ax/ojyk8bOP9+59G2amfUK92mYmVlhThpmZlbYiG2e2vDoBngIOKDqSMzM\neps7wqWY8NIJPPnGJ0vf9m5f343bb7zdHeFmNuL4PA0zMyuVk4aZmRXmpGFmZoU5aZiZWWFOGmZm\nVpiH3JqZjXIecusht2ZmbfOQWzMzK5WThpmZFeakYWZmhTlpmJlZYT2XNCQdL+lWSZdIOq7qeMzM\nbIueSxpAAOuAXYCVFcdiZmYNup40JM2VtEbSwqbyUyQtlvSApFn18oi4NSJOAz4MfKLb8ZmZWXFl\nHGnMA05uLJA0Brg4l88AzpI0vel5fwDGlRCfmZkV1PUzwiPiNklTm4qPBpZExDIASVcCM4HFkl5P\nSiYTSInFzMx6RFXTiEwCVjQsryQlEiLiauDqoVaw4dENMD8vTMPTiZiZNenk9CF1I3buqb6JfWw8\nYWPVYZiZ9axarUatVnt+ec6cOcNeZ1VJYxUwpWF5ci4rzBMWmpkV08kjjrKG3Cr/1d0JHCxpqqRx\nwJnAtSXFYmZm26mMIbdXAD8DDpW0XNLbI2IzcD5wI3AfcGVELGpnvX0T+3yUYWZWQK1Wo7+/vyPr\nKmP01Nktym8Abuj29s3MrHNGbEe4+zTMzIrxRZh8ESYzs7Z14iJMPtIwMxvlfKThIw0zs7b5cq9m\nZlYqN0+ZmY1ybp5y85SZWdvcPGVmZqVy0jAzs8Lcp2FmNsq5T8N9GmZmbXOfhpmZlcpJw8zMCnOf\nhpnZKOc+DfdpmJm1zX0aZmZWKicNMzMrzEnDzMwKc9IwM7PCnDTMzKwwD7k1MxvlPOTWQ27NzNrm\nIbdmZlYqJw0zMyvMScPMzApz0jAzs8J6MmlIGi/pTkmnVh2LmZlt0ZNJA5gFfKfqIMzMbGtdTxqS\n5kpaI2lhU/kpkhZLekDSrIby/wn8BngUGNbQMDMz66wyjjTmASc3FkgaA1ycy2cAZ0manu+uAX8G\nnA28s4T4zMysoK6fER4Rt0ma2lR8NLAkIpYBSLoSmAksjoiP57JzgMe6HZ+ZmRVX1TQik4AVDcsr\nSYnkeRFx2WAr2PDoBpifF6bh6UTMzJp0cvqQuhE791TfxD42nrCx6jDMzHpWrVajVqs9vzxnzpxh\nr7OqpLEKmNKwPDmXFeYJC83MiunkEUdZQ27F1iOh7gQOljRV0jjgTODadlbYN7HPCcPMrIBarUZ/\nf39H1tX1Iw1JV5BGRO0taTkwOyLmSTofuJGUuOZGxKJ21usjDTOzYjw1uqdGNzNrWyemRh+xHeE+\n0jAzK8ZHGj7SMDNrm480fKRhZjYkH2n4SMPMrG2+3KuZmZXKzVNmZqOcm6fcPGVm1rbSmqck/clw\nNmJmZqND0T6Nr0q6Q9J7JE3oakRmZtazCvVpRMSxkg4BzgV+KekOYF5E3NTV6AbhPg0zs2Iq69OQ\nNBY4HfgSsJY0CeFHI+IHHYmmeBzu0zAza1OZfRpHSPo8sAg4EXhtRLw03/78cAIwM7ORo+iQ2y8D\nl5KOKtbXCyNitaSPdyUyMzPrOUWTxmnA+ojYDCBpDNAXEc9ExOVdi24Q7tMwMyumiosw3Qzs2rA8\nPpdVxhdhMjMrppMXYSqaNPoi4qn6Qr49viMRmJnZiFE0aTwt6aj6gqQ/BdYP8ngzMxuFivZp/ANw\nlaTVpGG2+wFv7FpUZmbWk4qe3HenpOnAYbno/ojY1L2wzMysF7Uzy+0rgWn5OUflk0Qu60pUPe64\nE4/j8TWPl77dfSftyyMrHyl9u2ZmdYWShqTLgYOAu4HNuTiAypJGlUNuH1/zOPSXv901/WvK36iZ\njXilTyMiaRFwePTIPOpVTyOybtW6SpIG/dAjb4GZjUBlXrnv16TObzMz24EV7dPYB/hNnt12Y70w\nIl7XlajMzKwnFU0a/d0MwszMRoaiQ25vkTQVOCQibpY0Hhjb3dDMzKzXFJ0a/V3A94Cv5aJJwA+7\nEZCk6ZIukfQdSe/oxjbMzGz7FO0Ify9wDOnCS0TEEuBF3QgoIhZHxLuBM4GTurENMzPbPkWTxsaI\neLa+IGkn0nkaQ5I0V9IaSQubyk+RtFjSA5JmNd33WuB64MqC8ZmZWQmKJo1bJH0U2FXSa4CrgOsK\nPncecHJjQb4ex8W5fAZwVp6mBICIuC4iTgXeVnAbZmZWgqKjpz4MvAO4FzgP+DHpSn5Diojbcid6\no6OBJRGxDEDSlcBMYLGk44E3AH3A/ILxmZlZCYqOnnoO+Hr+64RJwIqG5ZWkREJE3ALcMtQKNjy6\nYUtKmYYvyGRm1qST04fUFZ176iEG6MOIiAM7Gk0b+ib2sfGEjUM/0MxsB1Wr1ajVas8vz5kzZ9jr\nLNo89YqG233AGcBew9juKmBKw/LkXFaYrxFuZlZM6dcIj4jHG/5WRcQXgNPa2I7yX92dwMGSpkoa\nRxpee20b6/M1ws3MCurkNcKLNk8d1bA4hnTkUfS5VwA1YG9Jy4HZETFP0vnAjXl9cyNiUTuB+0jD\nzKyYKqZGbxzF9EdgKfDZiLi/I1G0yVOjm5m1rxNToxcdPXXCcDbSDT7S2DHsN3k/1qwq/+JTvkqi\njSZVHGlcMNj9EfG5jkRTkI80dhySXNdmHVLakQapD+OVbOmsfi1wB7BkOBsfDh9pmJkVU8WRxq3A\naRGxLi/vBlwfEcd1JIo2+Uhjx+EjDbPOKfNyr/sCzzYsP5vLzMxsB1K0eeoy4A5JV+fl04Fvdiek\nYtw8Va6qOqTNbPhKb56C58/VODYv3hoRd3Ukgu3g5qnyVdlMtKPVtVm3lNkRDjAeWJtPzJso6YCI\neGg4G7c2jc1f3mZmFSl6Vvds0giqw0jXx9gZ+Bbpan5Wls1U86ubCrdrZj2l6JHG64GXA78CiIjV\neQRVZdynYWZWTOkTFgLPRmrgDQBJL+jI1ofBExaamRXTyQkLiyaN70r6GrCHpHcBN9O5CzKZmdkI\nUXTuqc/ma4OvJfVr/O+IuKmrkZmZWc8ZMmlIGgvcnCctdKKwHUOFI9U8WaL1siGTRkRslvScpAkR\nUf6JES24I9y6qsKRamv6fRKldVYnO8KLjp56CrhX0k3A0/XCiHhfR6LYDn0T+9h4gK8RbmY2lPq1\nwsu8RvgP8p+Zme3ABk0akqZExPKIqHSeKTMz6w1DDbn9Yf2GpO93ORYzM+txQyWNxuEjB3YzEDMz\n631D9WlEi9uV8+gpM7NiypxG5GWS1kpaBxyRb6+VtE7S2o5EsJ08jYiZWTGdnEZk0CONiBjbka2Y\nmdmoUHTuKTMzMycNMzMrzknDzMwKa+dyr6WRNBM4DdgN+IZn1DUz6w09mTQi4hrgGkl7AJ/Bs+ua\nmfWEUpqnJM2VtEbSwqbyUyQtlvSApFkDPPXjwFfKiNHMzIZWVp/GPODkxgJJY4CLc/kM4CxJ0xvu\nvwj4cUTcXVKMZmY2hFKSRkTcBjzRVHw0sCQilkXEJuBKYCaApPOBVwN/I+nvyojRzMyGVmWfxiRg\nRcPySlIiISK+DHx5sCdveHQDzM8L0/DZ4WZmTTo5fUhdT3aEF9E3sY+NJ/giTGZmrdQvvlRX5kWY\numEVMKVheXIuK8QTFpqZFVPmhIWdJLaeav1O4GBJUyWNA84Eri26Mk9YaGZWTGkTFnaKpCuAGrC3\npOXA7IiYlzu8byQlr7kRsajoOn2kYWZWTCePNEpJGhFxdovyG4AbtmedfRP72HiA+zTMzIZS79sY\n6X0aw+IjDTOzYkZqn0ZHuU/DzKyYTvZpjNikYWZm5XPzlJnZKOfmKdw8ZWZWlJunzMysEm6eMjMb\n5dw8hZunzMyKcvOUmZlVws1TZmajnJuncPOUmVlRbp4yM7NKOGmYmVlhThpmZlaYO8LNzEY5d4Tj\njnAzs6LcEW5mZpVw0jAzs8KcNMzMrDAnDTMzK8yjp8zMRjmPnsKjp8zMivLoKTMzq4SThpmZFeak\nYWZmhTlpmJlZYT2XNCQdIOlSSd+tOhYzM9tazyWNiHgoIt5ZdRxmZratricNSXMlrZG0sKn8FEmL\nJT0gaVa34zAzs+Er40hjHnByY4GkMcDFuXwGcJak6U3PUwmxmZlZG7qeNCLiNuCJpuKjgSURsSwi\nNgFXAjMBJO0l6RLgSB+BmJn1lqqmEZkErGhYXklKJETE74F3VxGUmZkNbmTPPTU/L0zDU4rY6DEW\npPJbZ/edtC+PrHyk9O1a93Ryzqm6qpLGKmBKw/LkXNaeaThZ2OizGegvf7Nr+teUv1HrqlqtRq1W\nG5ETFoqtO7bvBA6WNFXSOOBM4Np2VugJC83MiunkhIVdP9KQdAVQA/aWtByYHRHzJJ0P3EhKXHMj\nYlE76/XU6GZmxXTySKPrSSMizm5RfgNww/aut29iHxsP2LjdcZmZ7SjqzVRz5swZ9rpGdke4jzTM\nzIY0Evs0Os59GmZmxfgiTGZmVgk3T5mZjXJunsLNU2ZmRbl5yszMKuHmKTNLKpq+BDyFSbeNqPM0\nusXnaZh1WEXTl4CnMOm2Tp6n4eYpMzMrbMQeabh5ysysGI+ewqOnzMyK8ugpMzOrhJOGmZkV5qRh\nZmaFuSPczGyUc0c47gg3MyvKHeFmZlYJJw0zMyvMScPMzApz0jAzs8KcNMzMrDAPuTUzG+U85BYP\nuTUzK8pDbs3MrBJOGmZmVpiThpmZFeakYWZmhfXc6ClJ44GvAhuBWyLiiopDMjOzrBePNN4AXBUR\n5wGvqzqYtjxUdQADcEzFOKbiejCuTg0n7aRejKkTup40JM2VtEbSwqbyUyQtlvSApFkNd00GVuTb\nm7sdX0ctrTqAASytOoABLK06gAEsrTqAASytOoAWllYdwLZ68Qu6F2PqhDKONOYBJzcWSBoDXJzL\nZwBnSZqe715BShwAKiE+MzMrqOtJIyJuA55oKj4aWBIRyyJiE3AlMDPfdzXwN5K+AlzX7fjMzKw4\nRUT3NyJNBa6LiCPy8l8DJ0fE3+XlNwNHR8T7Cq6v+0GbmY1CETGsFpyeGz1VxHBftJmZbZ+qRk+t\nAqY0LE/OZWZm1sPKShpi607tO4GDJU2VNA44E7i2pFjMzGw7lTHk9grgZ8ChkpZLentEbAbOB24E\n7gOujIhFBdfXaqhuqSQtlXSPpLsk3ZHL9pR0o6T7Jf1E0oQux7DNcObBYpD0EUlLJC2SdFLJcc2W\ntFLSr/LfKWXFJWmypP+QdJ+keyW9L5dXWlcDxHV+Lq+yrnaR9PO8X98n6cJcXlldDRJTZfXUsJ0x\nedvX5uVe+PyNyXVVj6mz9RQRI+aPlOT+G5gK7AzcDUyvKJYHgT2byj4NfCjfngVc1OUY/hI4Elg4\nVAzA4cBdpH6sabkeVWJcs4ELBnjsS7sdF7AfcGS+/ULgfmB61XU1SFyV1VXezvj8fyxwO3BMD9TV\nQDFVWk95Wx8AvgVcm5d74fPXHFNH66kXzwgfzGBDdcsmtj1Smwl8M9/+JnB6NwOIgYczt4rhdaQj\nuj9GxFJgCak+y4oLBj7vZma344qIRyLi7nz7KWARqR+t0rpqEdekfHcldZVjeSbf3IW0jz9B9XU1\nUExQYT1JmgycClzatO3K6qlFTNDBehppSWMSW84WB1jJlg9Z2QK4SdKdkt6Zy/aNiDWQvhCAF1UQ\n14taxNBcd6sov+7+XtLdki5tOGwvNS5J00hHQbfT+v0qva4a4vp5LqqsrurNG8AjwIKI+A0V11WL\nmKDaferzwD+Svgvqqt6nBooJOlhPIy1p9JJjIuIoUlZ/r6Rj2faN6oXzSXohBkiTUB4YEUeSPvj/\nWnYAkl4IfA94f/5l3xPv1wBxVVpXEfFcRLycdDR2rKQaFddVU0zHSTqeCutJ0mnAmnykONgpAKXV\n0yAxdbSeRlrS6JmhuhHxcP7/KPBD0mHdGkn7AkjaD/hdBaG1imEV8JKGx5VadxHxaOSGVODrbDkM\nLiUuSTuRvpgvj4hrcnHldTVQXFXXVV1ErAV+DLyCHqirhpiuB15RcT0dA7xO0oPAt4ETJV0OPFJh\nPQ0U02WdrqeRljR6YqiupPH51yGSXgCcBNybY3lbfthbgWsGXEGHw2HrXxWtYrgWOFPSOEkHAAcD\nd5QVV/4A1b0B+HXJcX0D+E1EfLGhrBfqapu4qqwrSfvUmy8k7Qq8htRZWlldtYjp7irrKSI+GhFT\nIuJA0vfQf0TEW0hTH70tP6zUemoR0zkdr6du9N538w84hTTKZAnw4YpiOIA0cusuUrL4cC7fC7g5\nx3cjsEeX47gCWE269shy4O3Anq1iAD5CGiGxCDip5LguAxbmevshqe23lLhIv8A2N7xnv8r7Ucv3\nq4y6GiSuKuvqT3IcdwH3AB8cat+uMKbK6qkpvuPZMlKp0n2qRUwdradS5p4yM7PRYaQ1T5mZWYWc\nNMzMrDAnDTMzK8xJw8zMCnPSMDOzwpw0zMysMCcNswaSTpf0nKRDW9w/QdK7G5ZfLOm7Q6xzvqSj\nOh2rWRWcNMy2dibwI+Cs5jskjSWdPPmeellEPBwRf1teeGbVctIwy/KUMH8GvJeUPJB0vKRbJV1D\numDYp4CD8sVsPp2ntLk3P3aMpM8oXVDpbknvHWAbr5H0M0m/kPQdSeNz+UWSfp2f93/Kes1m7dqp\n6gDMeshM4CcRsULS7yS9PJe/HJgREcslTc23jwLIy/VpFc4jXSDsiIgISXs0rlzS3sDHgVdHxHpJ\nHwIukPRV4PSImJ4ft3u3X6jZ9vKRhtkWZwH1/omrgLPz7TsiYnmB578a+FrkuXki4g9N97+KdAW3\nn+ZrQ5yzqlhjAAAA/klEQVRDmrX5SWB9vtbB64H1w3sZZt3jIw0z0rWdgROB/yEpSJcVDdI03E93\najPAjRHxpgG2fzQp6ZwB/H2+bdZzfKRhlpwBXBYRB0TEgRExFXgIOLbpceuA3Vqs4ybgvNxhXk9E\njW4HjpF0UL5/vKRDcl/KHhHx/4ALgCM685LMOs9Jwyx5I3B1U9kPSB3iz08FHRG/JzUvLZT06abH\nX0q6fObC3PxUH4FVb656jHSthW9Lugf4GXAYKQn9KJfdCnygg6/LrKM8NbqZmRXmIw0zMyvMScPM\nzApz0jAzs8KcNMzMrDAnDTMzK8xJw8zMCnPSMDOzwpw0zMyssP8P7jJLSDHC5AsAAAAASUVORK5C\nYII=\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7f3a38a1a2d0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "plt.hist(np.asarray(r1).flatten(), facecolor='green')\n",
    "plt.title(\"Distribution of the number of articles per author\")\n",
    "plt.xlabel(\"Articles\")\n",
    "plt.ylabel(\"Frequency\")\n",
    "plt.yscale('log', nonposy='clip')\n",
    "plt.show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "result = session.run(\"MATCH (n:Authors)-[r:isCoauthor]-(m:Authors) WITH n.author_id as ntop, COUNT(r) as rank  order by rank desc RETURN rank\")\n",
    "r2=[]\n",
    "for line in result:\n",
    "    r2.append(line[\"rank\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 91,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAY0AAAEZCAYAAABrUHmEAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAH4lJREFUeJzt3Xu4HFWZ7/HvL4khBgbkEkEScgHEIHIRkXFEhh08CoKA\nOqNcBhEcxQcVRh00ojjZkQPjXLyjHo9iNNEQRUVA4YgM2VFUBOUqBImSkJuGcJE7AZL3/LFWQ6ez\ne2ft7O6u3uT3ybOfdK/qWvX26up6u2qtqlJEYGZmVmJE1QGYmdnw4aRhZmbFnDTMzKyYk4aZmRVz\n0jAzs2JOGmZmVsxJox+SviLp4y2qaxdJD0lSfj5f0jtbUXeu73JJb29VfYNY7v+WtFrSysLXz5A0\np91xtZqkWZI+WfHy75d0bVUxbEyr1+nnKkmLJR1adRxDtdklDUlLJD0m6cH8ZbxG0ntqG3WAiDgt\nIs4tqGujK0FELIuIraMFJ8TkDe/shvqPiIiObowl7QJ8CJgaETv3M/0QScv6mdUnBQ2CpNcArwV2\njohXVR0P9L8O2oaq/rHRTptd0iBtuI6MiG2AScCngOnABa1ekKSRra6zS0wC7o2I+5pMF04QG5A0\n2O/bZGBJRDzRhnC6TpXfl034bCpT+XYlIjarP2AxcGhD2SuBtcBL8/NZwCfz4+2By4AHgPuABbl8\ndp7nUeAh4EzSxnQd8E7gbqCvrmxEnm8+cB7wG+BB4GLgBXnaIcCy/uIFDgPW5L+HgRvr6ntnfizg\nbGAJ8Bfgm8DWeVotjpNybPcAHxugnbbO7/GeHMPHc/lrgceAp/P7/kbDfGPrpj+cX7MTMAP4LvCt\nXHYrsH/dfC8Cvp+X9yfg9AFimwWcD/w41/VrYErD+xxR9/r6NnoHcA3wmfyZLgJeDZwMLM3tdlLD\nsr4CXJmXNR+YWDd9ap52H7AQeGvDvF8GfpLb4tB+3suLgEvy/HcC78rl7wQeB57Ky53RpC3eDdye\nX/N7YL+6uObn93grcFTdPEcAN5DWv7vr62bT18FP5nZ9CPh/wHZ18x+dY7sfuJq0h1pf90eAm/P7\nHUH6Ebc817UQmDbAetDOz+bkurb9I3Bq3bR3AL9oeP06YNf8mTwJPJHnvaTuvf5rfq8PABcCoxs+\ny0XAvcCPgBc11P3evI78qdJtaJULr+QN95M0cvndwHvqVqha0jgvr1wjgJHAQQ11Tat7XttgfRN4\nPrBFLlvL+kljGbBnfs33gTl52iHA0mbxkja8sxum128Q35lXqkmkjfcPaq+vi+2rwGhgn7xSv6RJ\nO80mJbSxed4/AKc0i7Nh3v7exwxSMjmMlNzOA36dpwn4LfDx3MaT85f0dU3qnwWsBl6RP5dvA3Pr\n3ucz7d1PG72D9IU+KS/3nPx5fBF4HvA60hd9bN2yHgQOytM/R95Y5LZZWlfXvjmuqXXzPgC8Kj8f\n3c97+XndsvclJc2eulh/PkA7vzXHvn9+viuwCzCKtPGZnh9Py+/pxfl1fw/slR+/DPgzcPQQ18FF\nwG6kdX4+cF6etgfwCCnpjAQ+nF87qq7uG4Cd87x75DbdMU+fSP5B0GQ9aOdn8wZgcn58MOkHYi0p\nb/DZkNa7XRu3IQ3teC2wI/ACUkI6NU87NMe3b34vXyD/QM3T1wE/BbYBtqhi21n7Gza7ZB2wEtiu\nn/KnSL8Gp0TE2oj4ZcN0NTwP0i+3xyNiTZNlzYmIhRHxOPAJ4K31fSpDcALwmYi4OyIeA84Cjqvb\n9Q6gNyKejIhbSL949m2sJL/+WOCjEfFYRNwNfBoYaof7NRHx00jfgjmkxAVwILBDRJyb23gJ8HXg\nuAHqujgifhcR64DvAPsNIo7FETE7x/Fd0gZrZkQ8FRE/IyWV3ete/5OI+GVEPEVKbK+SNB54Y31d\nEXEzKVG/tW7eSyLiWoCIeLI+CEkTgL8Dpudl35zf90mF7+Ofgf+MiBty/XdFxDLgVcCWEfEfEfF0\nRMwn7ZUdn1/384i4LT/+PTCPlCyGYlZE/Cmv89/j2c/jbcCPI+LqiFgL/Dfpx9Kr6+b9fESszPOu\nJf2oeZmkURGxNCIWD7Dctnw2ueyKvC4SEb8g7bUcPEAsJd/hz0fEqoj4K+kIRq2dTgAuiIib83s5\nC/g7SRPr5j0vIh4cYLvSEU4azxpP2n1u9F+kwyVXSvqjpOkFdS3fyPT6TuK7Sb8sdiiKcmA75/rq\n6x5F+mVTs6ru8WPAVv3Us0Oeb2lDXeOHGN9fGpY9JieoicD4PDDhfkkPkL40LxxEXf29j2bq2+Bx\ngIi4t6Gsvr5nPq+IeJT0C3Vn0l7NqxriPoH127u/AQE1OwP35wRfM5h23oW0bvZXb+Nyn6lX0t9K\nulrSPZL+CryHoa9/zT6P9dbJnKiXsf57XF43/U/AB4BeYJWkuZJeNMBy2/XZIOkNkn4t6b48/xsY\nejs1+/41ttOjpMNq/bZTlZw0AEmvJH1ov2icFhGPRMSZEbEb6djshyRNq01uUmWz8ppd6h5PIu3N\n3Eva/R1bF9dIYNwg6l2Z62use1X/L2/q3jxfY10rCuffWJyNlgF3RcR2+W/biNgmIo4aZD2Q2hDq\n2pHUpzIUz3xekrYCtiW19TKgryHurSPi/XXzDtQWK4HtJG1ZVzaR8nZeRjok1F+9uzSU1df7HdIx\n8/ER8QLSIcvar+ShroP9xTKpoWwX1t8ArldnRMyLiIPr5vvUAPW35bORNJp06Pg/gXERsS1wBc3b\nqXEdG1I75XViewZop6ps1klD0t9IeiOpQ2pORNzez2uOlFT7Yj5M6uBdm5+vIh1HXm+W/hbV8PxE\nSVMljQVmAhflX2B3kn59v0HSKFKn9ui6+VYBkwc4lHUh8EFJk/MX6FxgXj6E0yy2DeTXfw84V9JW\nkiYBHyQdUiqxCthe0tYbeV0tnuuAhyV9RNIYSSMl7SXpgMLl1cd+L2njeKKkEfn8gf42rP3F0cwR\nkl6dNyTnANdGxArSIZ89JJ0oaZSk50k6QNJLCmNdDvwK+HdJW0jah3TIqbSdvw6cKWl/AEm75eHQ\nvwEey+05SlIP6XDNhXm+rYAHIuIpSQeSfoHXDHUdbPQ94EhJ03IsZ5L60n7d34sl7ZFfO5p0mPBx\n0vH8Ztry2ZDe82jSKMF1kt4AvL5u+s3AXpL2kbQFqa+nfqPe37ZhIBcCp9TVd15+LwPuDVWhK5OG\npLGSrpd0RJsWcZmkB0mHX84iHWdtdnLSi4GrJD0M/BL4UkT8PE/7d+ATeff3Q7msv18D0fB4DmkU\n0UrSivkvABHxEGmExAWkXxgPs/4vjYtIG7j7JP22n7q/kev+OemwxWPAGU3iaBZrzRl5/rtyfd+O\niFkDvP7ZSiP+QPoS3JXbptkv/civX0faqO1H6iy8B/gaaQRX0/kG8G7SiJx7SQMOGvuhNlZf4+c1\nl3S45D7g5cCJOe5HSBuS40if5UrSr+ItNrK8escDU/K8PwA+kfsgNioivk/6YTBX0kOkgQvb5WPi\nR5FGSd1LGmn29ohYlGd9L3BO/g6cTerXqdU51HWwMcY7Se11Pqmj90jSSK6nm8y7BakNV+c2GUf6\njjbTls8mz38GcJGk+3M9l9RNX0QaMfY/pETbeJTiAlJSuV/SD5u81/rl/Q+pf/OHpB89U1i/T68r\n9jIAlH7gdhdJM0kr6+0RcXnV8ZhZ95E0izQ8+N+qjmVz0vY9DUkXSFol6ZaG8sMl3SHpzvrOZUn/\nizQUbTWFh1PMzKwzOnF4ahZpbP4z8oiZ83P5XsDxkqbmyT3A35KOs76rA/GZ2fDUfYdJNgOj2r2A\niLgmd6TWOxBYFGn8P5LmAccAd0TE2bnsJNLxWDOzDUSEL5JYgbYnjSbGs/4Y6eWkRPKMiPBF0czM\nukxVSWNIJHm31MxsE0TEkPqKqxpyu4J0slHNBMpPaAK685pZM2bMqDwGx+SYNse4HFPZXyt0KmmI\n9UdCXQ/sLmlSPinnOODSwVTY29tLX19f6yI0M3uO6uvro7e3tyV1dWLI7VzSWa97SFoq6ZRIFy47\nnXQBsNtIZy0vHEy9vb299PT0tDxeM7Pnmp6enpYljU6MnjqhSfkVpGu5PGd0YxJzTGUcU7lujMsx\ndU5XnhG+MZJixowZ9PT0PGc/GDOzVunr66Ovr4+ZM2cSQ+wIH7ZJYzjGbWZWJUlDThpdecFCMzPr\nTsM2aXj0lJlZmVaOnvLhKTOzzYQPT5mZWUc5aZiZWbFhmzTcp2FmVsZ9Gu7TMDMbNPdpmJlZRzlp\nmJlZsWGbNNynYWZWxn0a7tMwMxs092mYmVlHOWmYmVkxJw0zMyvmpGFmZsWGbdLw6CkzszIePeXR\nU2Zmg+bRU2Zm1lFOGmZmVsxJw8zMijlpmJlZsVFVB7CpTnv3aTzx+BOVxrDb7rtxdu/ZlcZgZtZJ\nw3b01JajtmTvp/dmB3aoJIYguFyXs27dukqWb2ZWqq+vj76+PmbOnDnk0VPDNmnsuc2eHPvgsZXF\nsI51nKNznDTMbNjwkFszM+soJw0zMyvmpGFmZsWcNMzMrJiThpmZFXPSMDOzYk4aZmZWzEnDzMyK\nDdvLiKx+YjWLWcwUplQdiplZV6udEd4KPiN8E/mMcDMbbnxGuJmZdZSThpmZFXPSMDOzYk4aZmZW\nzEnDzMyKOWmYmVkxJw0zMyvmpGFmZsWcNMzMrFjXJQ1JUyV9RdJ3Jf1z1fGYmdmzui5pRMQdEXEa\ncBzw+qrjMTOzZ7U9aUi6QNIqSbc0lB8u6Q5Jd0qa3jDtKOAnwLx2x2dmZuU6sacxCzisvkDSCOD8\nXL4XcLykqbXpEXFZRBwBnNyB+MzMrFDbL40eEddImtRQfCCwKCLuBpA0DzgGuEPSIcBbgDHA/HbH\nZ2Zm5aq6n8Z4YFnd8+WkREJELAAWbKyC1U+sZn7OKZOZ7PtqmJk1aOV9NGqG7U2Yxo0Zx7Q106oO\nw8ysa/X09NDT0/PM85kzZw65zqpGT60AJtY9n5DLzMysi3VqT0P5r+Z6YPfc1/Fn0vDa4wdToW/3\namZWppWHqTox5HYu8CtgD0lLJZ0SEWuB04ErgduAeRGxcDD1jhszzgnDzKxAT08Pvb29LamrE6On\nTmhSfgVwRbuXb2ZmrTNsO8J9eMrMrEwrD08pIlpSUSdJij232ZNjHzy2shjWsY5zdA7r1q2rLAYz\ns8GQRERo469sruuuPWVmZt3Lh6fMzJ7jfHjKh6fMzAbNh6fMzKyjnDTMzKyY+zTMzJ7j3KfhPg0z\ns0Fzn4aZmXWUk4aZmRVzn4aZ2XOc+zTcp2FmNmju0zAzs44atoenzMyGiwk7TWDFqmpvTjp+x/Et\nqcdJw8yszVasWkEvvZXG0LuqNcv34SkzMys2bJNGbfSUmZkNrJXbymGbNHyPcDOzMq3cVg7bpGFm\nZp3npGFmZsWcNMzMrJiThpmZFXPSMDOzYsM2aXjIrZlZGQ+5xUNuzcxKdXzIraS9W7ZEMzMbtkr3\nNL4s6TpJ75W0TVsjMjOzrlWUNCLiYOCfgF2A30maK+l1bY3MzMy6TnGfRkQsAs4GpgOHAF+QdIek\nt7QrODMz6y6lfRr7SPossBA4FDgqIvbMjz/bxvjMzKyLlO5pfBG4Adg3It4XETcARMRK0t6HWeUm\n7DQBSZX/TdhpQtVNYdY2pTdhOhJ4PCLWAkgaAYyJiMciYk7bojMbhG640Q207mY3Zt2odE/jKuD5\ndc/H5rLK+OQ+M7MyVZzcNyYiHqk9yY/HtiyKTeCT+8zMylRxP41HJe1feyLpFcDjLYvCzMyGhdI+\njQ8AF0laCQjYCTi2bVGZmVlXKkoaEXG9pKnAS3LRHyLiqfaFZWZm3ah0TwPglcDkPM/+koiI2W2J\nyszMulJR0pA0B9gNuAlYm4sDcNIwM9uMlO5pHAC8NCKincGYmVl3Kx099XtS57eZmW3GSvc0dgBu\nl3QdsKZWGBFHtyUqMzPrSqVJo7edQZiZ2fBQOuR2gaRJwIsj4ipJY4GR7Q3NzMy6Teml0d8NfB/4\nai4aD/yoXUFJOkbS/5V0oW/2ZGbWPUo7wt8HHAQ8BM/ckOmF7QoqIi6JiFOB04C3tWs5ZmY2OKVJ\nY01EPFl7ImkU6TyNIpIukLRK0i0N5Yfnu//dKWl6P7OeDXypdDlmZtZepUljgaSPAc/Ph4suAi4b\nxHJmAYfVF+R7cpyfy/cCjs+XKqlN/xRweUTcNIjlmJlZG5UmjY8Cq4FbgfcAlzOIO/ZFxDXAAw3F\nBwKLIuLufB2recAxAJJOB14L/KOkU0uXs7nqhjvW+W51ZpuH0tFT64Cv5b9WGQ8sq3u+nJRIiIgv\nkm4x29TqJ1Yzn/kATGbyZn1vjW64Y53vVmfWfRazmCUsaWmdpdeeWkw/fRgRsWtLoxmEcWPGMW3N\ntKoWb2bW9abkfwALWNCSOgdz7amaMcBbge2GuOwVwMS65xNymZmZdamiPo2IuK/ub0VEfA44cpDL\nUv6ruR7YXdIkSaOB44BLSyvzPcLNzMq0cltZenhq/7qnI0h7HsX34pA0F+gBtpe0FJgREbNyh/eV\nuc4LImJhaZ3jxoxjyprNtx/DzKxUK/t8Szf8n657/DSwhEGcdBcRJzQpvwK4orQeMzOrVunoqa7r\nca4dntqcR02ZmZWo4vDUhwaaHhGfaU045Xx4ysysTBWHpw4g3SO81lF9FHAdsKhlkZiZWdcrTRoT\ngP0j4mEASb3ATyLixHYFtjE+PGVmVqaVh6dKLyOyI/Bk3fMnc1llxo0Z54RhZlagisNTs4HrJF2c\nn78J+FbLojAzs2GhdPTUuZKuAA7ORadExI3tC8vMzLpR6eEpgLHAQxHxeWC5pEqPDfmMcDOzMh3v\n05A0A5gOnJWLngd8u2VRbAL3aZiZlWnltrJ0T+PNwNHAowARsRL4m5ZFYWZmw0Jp0ngyIoJ8eXRJ\nW7YvJDMz61alSeN7kr4KvEDSu4GraO0NmQbNfRpmZmU6fhmRiPjvfG/wh4CXAP8WET9rWRSbwJcR\nMTMr09HzNCSNBK7KFy2sNFGYmVm1Nnp4KiLWAuskbdOBeMzMrIuVnhH+CHCrpJ+RR1ABRMQZbYnK\nzMy6UmnS+GH+6xq+YKGZWZmOdYRLmhgRSyOi664z5Y5wM7MynTy570e1B5J+0LKlmpnZsLSxpKG6\nx7u2MxAzM+t+G0sa0eSxmZlthjbWEb6vpIdIexzPz4/JzyMitm5rdGZm1lUGTBoRMbJTgZiZWfcb\nzP00uoqvPWVmVqaKe4R3Hd9Pw8ysTBX30zAzM3PSMDOzck4aZmZWzEnDzMyKOWmYmVkxJw0zMyvm\npGFmZsWcNMzMrNiwTRo+I9zMrIzPCMdnhJuZlfIZ4WZmVgknDTMzK+akYWZmxZw0zMysmJOGmZkV\nc9IwM7NiThpmZlbMScPMzIo5aZiZWTEnDTMzK9Z1SUPSFElfl/S9qmMxM7P1dV3SiIjFEfGuquMw\nM7MNtT1pSLpA0ipJtzSUHy7pDkl3Spre7jjMzGzoOrGnMQs4rL5A0gjg/Fy+F3C8pKkN86kDsZmZ\n2SC0PWlExDXAAw3FBwKLIuLuiHgKmAccAyBpO0lfAfbzHoiZWXcZVdFyxwPL6p4vJyUSIuJ+4LSN\nVbD6idXMZz4Ak5nse2uYmTVYzGKWsKSldVaVNIZs3JhxTFszreowzMy61pT8D2ABC1pSZ1Wjp1YA\nE+ueT8hlZmbWxTqVNMT6HdvXA7tLmiRpNHAccOlgKvQ9ws3Mygyre4RLmgv8CthD0lJJp0TEWuB0\n4ErgNmBeRCwcTL2+R7iZWZlWbivb3qcRESc0Kb8CuGJT663taThxmJkNbFjtabSL9zTMzMq0cls5\nbJOGmZl1npOGmZkVG7ZJw6OnzMzKuE8D92mYmZVyn4aZmVVi2CYNH54yMyvjw1P48JSZWSkfnjIz\ns0o4aZiZWTEnDTMzKzZsk4Y7ws3MyrgjHHeEm5mVcke4mZlVwknDzMyKOWmYmVmxYZs03BFu3Wok\nI5FU6d+EnSZU3QzWRVq5rWz7nfvaZdyYcUxZ445w6z5rWUsvvZXG0Luq2uVbd3FHuJmZVcJJw8zM\nijlpmJlZMScNMzMr5qRhZmbFhm3S8JBbM7MyvvYUvvaUmVkpD7k1M7NKOGmYmVkxJw0zMyvmpGFm\nZsWcNMzMrJiThpmZFXPSMDOzYk4aZmZWbNgmDZ8RbmZWxmeE4zPCzcxK+YxwMzOrhJOGmZkVc9Iw\nM7NiThpmZlbMScPMzIo5aZiZWTEnDTMzK+akYWZmxZw0zMysmJOGmZkVG1V1AI0kjQW+DKwBFkTE\n3IpDMjOzrBv3NN4CXBQR7wGOrjqYwejr66s6hA1040Ud3U5lujEm6M7PzzF1TtuThqQLJK2SdEtD\n+eGS7pB0p6TpdZMmAMvy47Xtjq+VunElWcKSqkPYgNupTDfGBN35+TmmzunEnsYs4LD6AkkjgPNz\n+V7A8ZKm5snLSIkDQB2Iz8zMCrU9aUTENcADDcUHAosi4u6IeAqYBxyTp10M/KOkLwGXtTs+MzMr\np4ho/0KkScBlEbFPfv4PwGERcWp+fiJwYEScUVhf+4M2M3sOioghHcHputFTJYb6ps3MbNNUNXpq\nBTCx7vmEXGZmZl2sU0lDrN+pfT2wu6RJkkYDxwGXdigWMzPbRJ0YcjsX+BWwh6Slkk6JiLXA6cCV\nwG3AvIhYWFhfs6G6HSVpiaSbJd0o6bpctq2kKyX9QdJPJW3T5hg2GM48UAySzpK0SNJCSa/vcFwz\nJC2XdEP+O7xTcUmaIOlqSbdJulXSGbm80rbqJ67Tc3mVbbWFpN/k9fo2Sefl8sraaoCYKmunuuWM\nyMu+ND/vhu/fiNxWtZha204RMWz+SEnuj8Ak4HnATcDUimK5C9i2oew/gI/kx9OBT7U5htcA+wG3\nbCwG4KXAjaR+rMm5HdXBuGYAH+rntXu2Oy5gJ2C//Hgr4A/A1KrbaoC4KmurvJyx+f+RwLXAQV3Q\nVv3FVGk75WV9EPg2cGl+3g3fv8aYWtpO3XhG+EAGGqrbaWLDPbVjgG/lx98C3tTOAKL/4czNYjia\ntEf3dEQsARaR2rNTcUH/590c0+64IuIvEXFTfvwIsJDUj1ZpWzWJa3yeXElb5Vgeyw+3IK3jD1B9\nW/UXE1TYTpImAEcAX29YdmXt1CQmaGE7DbekMZ5nzxYHWM6zX7JOC+Bnkq6X9K5ctmNErIK0QQBe\nWEFcL2wSQ2PbraDzbfd+STdJ+nrdbntH45I0mbQXdC3NP6+Ot1VdXL/JRZW1Ve3wBvAXoC8ibqfi\ntmoSE1S7Tn0W+DBpW1BT9TrVX0zQwnYabkmjmxwUEfuTsvr7JB3Mhh9UN5xP0g0xQLoI5a4RsR/p\ni//pTgcgaSvg+8C/5F/2XfF59RNXpW0VEesi4uWkvbGDJfVQcVs1xPT3kg6hwnaSdCSwKu8pDnQK\nQMfaaYCYWtpOwy1pdM1Q3Yj4c/5/NfAj0m7dKkk7AkjaCbingtCaxbAC2KXudR1tu4hYHflAKvA1\nnt0N7khckkaRNsxzIuKSXFx5W/UXV9VtVRMRDwGXAwfQBW1VF9NPgAMqbqeDgKMl3QVcCBwqaQ7w\nlwrbqb+YZre6nYZb0uiKobqSxuZfh0jaEng9cGuO5eT8sncAl/RbQYvDYf1fFc1iuBQ4TtJoSVOA\n3YHrOhVX/gLVvAX4fYfj+gZwe0R8vq6sG9pqg7iqbCtJO9QOX0h6PvA6UmdpZW3VJKabqmyniPhY\nREyMiF1J26GrI+LtpEsfnZxf1tF2ahLTSS1vp3b03rfzDzicNMpkEfDRimKYQhq5dSMpWXw0l28H\nXJXjuxJ4QZvjmAusJN17ZClwCrBtsxiAs0gjJBYCr+9wXLOBW3K7/Yh07LcjcZF+ga2t+8xuyOtR\n08+rE201QFxVttXeOY4bgZuBMze2blcYU2Xt1BDfITw7UqnSdapJTC1tp45ce8rMzJ4bhtvhKTMz\nq5CThpmZFXPSMDOzYk4aZmZWzEnDzMyKOWmYmVkxJw3b7EjaUdKF+ZLQ10v6saTdW1j/O+pPqJK0\nWNJ2rarfrEpOGrY5uph0tuyLI+KVpBOcdmxh/Sez/oXfNvlkKEkjhxyNWQs5adhmRdI04MmI+Fqt\nLCJujYhfSvovpZsh3Szpbfn1W0q6StJvc/nRuXySpFvr6v3XfLObfyBdq+nb+YY3Y0iXUzlD0u9y\nHXvkebaVdHEu+5Wkl+XyGZJmS7oGmC3ppUo3IbohX6l0t061l1mjUVUHYNZhLwN+11go6S3APhGx\nt6QXAtdLWgDcC7wpIh6RtD3pkuq1651tcOXXiPiBpPeTbnpzY64b4J6IeIWk04AzgVOBmcANEfHm\nnMzmAC/Pde1JupLyk5K+AHwuIi7MFzj03odVxnsaZslrSFcGJSLuAfqAV5L2Ej4l6WbSNYV2zkll\nYxovl31x/v93pLuk1ZY5Jy9zPrBd7UKYpOsGPZkf/xr4uKQPA5MjYs3g3ppZ6zhp2ObmNtLho42p\nbfT/CdgeeHmk+zncA4wBnmb9X/xjNlJfbUO/lrI9/EdrDyLiQuAo4Ang8nx/C7NKOGnYZiUirgZG\n69m7LSJpb+CvwLH5DnHjgINJl4nehnRoaV0+hDQpz7YKGJf7JbYA3li3mIeBrQvC+QVwYo6hB7g3\n0k2Y1iNpSkQsjogvki61vc+g3rRZC7lPwzZHbwY+L+mjwOPAEuADwJakS2+vAz4cEfdI+g5wWT48\n9VvSJaSJiKclfZJ0j5fltfLsm8D/kfQY8Gqaj57qBb6R634UOKnJ694m6e3AU8CfgXM34T2btYQv\njW5mZsV8eMrMzIo5aZiZWTEnDTMzK+akYWZmxZw0zMysmJOGmZkVc9IwM7NiThpmZlbs/wN2vKhG\nBuJ3AwAAAABJRU5ErkJggg==\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7f3a384c2850>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "plt.hist(np.asarray(r2).flatten(), facecolor='purple')\n",
    "plt.title(\"Distribution of the number of coauthors per author\")\n",
    "plt.xlabel(\"Coauthors\")\n",
    "plt.ylabel(\"Frequency\")\n",
    "plt.yscale('log', nonposy='clip')\n",
    "plt.show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "session.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
